app/controllers/links_controller.rb

INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["url", "lfkdfgh.com"], ["user_id", 1], ["created_at", "2017-02-02 06:24:39.828740"], ["updated_at", "2017-02-02 06:24:39.828740"]]
---
  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save

DELETE FROM "links" WHERE "links"."id" = ?  [["id", 1]]
---
  def destroy
    if(current_user == @link.user)
      @link.destroy